Revit 2027 API
DisciplineTypeId.Piping Property
 Piping.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId Piping { get; }
Public Shared ReadOnly Property Piping As ForgeTypeId
	Get
public:
static property ForgeTypeId^ Piping {
	ForgeTypeId^ get ();
}
static member Piping : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
DisciplineTypeId Class
Autodesk.Revit.DB Namespace